12/data/attachments/b772118bdb5499ce.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Ryan_upon_Friend_38328_0</nif:username>
            <nif:friendToBeRequested>soap_friends_6cf6109e-6903-4532-a6c8-84eaf49ac264</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>